espressif/esp-adf/components/esp_ota_service/examples/ota_fs/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# CPU / PSRAM (ESP32-S3-Korvo-2 V3)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024

# Board profile (Korvo2 V3 peripherals, devices, FS mount /sdcard) is in:
#   components/gen_bmgr_codes/board_manager.defaults
# Regenerate with: idf.py gen-bmgr-config -b esp32_s3_korvo2_v3
